# import libraries

In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import warnings

warnings.filterwarnings("ignore")

%matplotlib inline

In [29]:
df1=pd.read_csv('data/image_data.csv')
df2 = pd.read_csv('data/text_data.csv', encoding='ISO-8859-1')
df3=pd.read_csv('data/voice_data.csv')

In [30]:
df1.head()

,Image,Caption
0,1000268201_693b08cb0e.jpg,A child in a pink dress is climbing up a set o...
1,1000268201_693b08cb0e.jpg,A girl going into a wooden building .
2,1000268201_693b08cb0e.jpg,A little girl climbing into a wooden playhouse .
3,1000268201_693b08cb0e.jpg,A little girl climbing the stairs to her playh...
4,1000268201_693b08cb0e.jpg,A little girl in a pink dress going into a woo...

In [33]:
df2.head()

,Sentiment,ID,Date,Query,User,Text,Unnamed: 6,Unnamed: 7
0,0,1467810369,Mon Apr 06 22:19:45 PDT 2009,NO_QUERY,_TheSpecialOne_,"@switchfoot http://twitpic.com/2y1zl - Awww, t...",NaN,NaN
1,0,1467810672,Mon Apr 06 22:19:49 PDT 2009,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...,NaN,NaN
2,0,1467810917,Mon Apr 06 22:19:53 PDT 2009,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...,NaN,NaN
3,0,1467811184,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,ElleCTF,my whole body feels itchy and like its on fire,NaN,NaN
4,0,1467811193,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,Karoli,"@nationwideclass no, it's not behaving at all....",NaN,NaN

In [38]:
df3.head()

,Filename,Content_Text,Up_Votes,Down_Votes,Age,Gender,Accent,Duration
0,cv-invalid/sample-000000.mp3,revenge is not my style but obviously accident...,1,10,NaN,NaN,NaN,NaN
1,cv-invalid/sample-000001.mp3,it was bunched up and he had hardly thought of...,0,2,twenties,male,us,NaN
2,cv-invalid/sample-000002.mp3,then suddenly he noticed it with a start,10,4,thirties,female,canada,NaN
3,cv-invalid/sample-000003.mp3,that's the point at which most people give up,0,1,NaN,NaN,NaN,NaN
4,cv-invalid/sample-000004.mp3,you got someplace to sleep,0,1,NaN,NaN,NaN,NaN

shape of dataset

In [ ]:
df1.shape, df2.shape, df3.shape  ## no. of record and column.

((40455, 2), (1048486, 8), (25403, 8))

In [ ]:
df1.isna().sum()    ## missing values

Image      0
Caption    0
dtype: int64

In [41]:
df1.duplicated().sum()

np.int64(10)

In [ ]:
df1 = df1.drop_duplicates(keep=False) ## drop duplicates

In [43]:
df1.duplicated().sum()  # Should output 0

np.int64(0)

In [ ]:
df1.info()  ## check null and dtypes

<class 'pandas.core.frame.DataFrame'>
Index: 40435 entries, 0 to 40454
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Image    40435 non-null  object
 1   Caption  40435 non-null  object
dtypes: object(2)
memory usage: 947.7+ KB